{"d1e3": {"l": "./chapter2.html#topic_rxx_dkt_bdc","t": "Chapter 2","d": "<div class=\"abstract\"><p class=\"shortdesc\">Charlie's Song \"I told you,\" said Charlie the Choo-Choo. \"How come I never knew you were alive before?\" asked Engineer Bob. \"Why didn't you ever talk to me before?\" Then Charlie sang this song to Engineer Bob in his small, gruff voice: INSERT SONG CONTENT REF \"Say what now?...</p></div>"},"d1e10": {"l": "./chapter3.html#topic_rxx_dkt_bdc","t": "Chapter 3","d": "<div class=\"abstract\"><p class=\"shortdesc\">New Locomotive in Town One day, when Engineer Bob returned to St. Louis, they found a new diesel locomotive in Charlie's berth. And what a diesel locomotive it was! Five thousand horsepower! Stainless steel couplers connectors! Traction motors from the Utica Engine Works in...</p></div>"},"d1e17": {"l": "./chapter4.html#topic_rxx_dkt_bdc","t": "Chapter 4","d": "<div class=\"abstract\"><p class=\"shortdesc\">Replaced \"Nonsense!\" Engineer Bob was mad! \"Charlie is still full of zip and zowie! I will telegraph the head office of the Mid-World Railway Company! I will telegraph the president, Mr. Raymond Martin, myself! I know him because he once gave me a Good Service Award, and af...</p></div>"},"d1e24": {"l": "./chapter6.html#topic_rxx_dkt_bdc","t": "Chapter 6","d": "<div class=\"abstract\"><p class=\"shortdesc\">The President has a Problem Mr. Martin, the president of the Mid-World Railway Company, came to St. Louis to check on the operation. His plan was to ride the Burlington Zephyr to Topeka, where his daughter was giving her first piano recital, that very afternoon. Only the Ze...</p></div>"},"d1e31": {"l": "./reuse.html#topic_lj2_trr_cdc","t": "reuse","d": "<div class=\"abstract\"><p class=\"shortdesc\">Don't ask me silly questions, I won't play silly games. I'm just a simple choo-choo train, and I'll always be the same. I only want to race along, beneath the bright blue sky. and be a happy choo-choo train, until the day I die. gobbling up naughty children, until the day I...</p></div>"},"d1e39": {"l": "./index.html#topic_aw3_bt2_bdc","t": "Welcome to my Story","d": "<div class=\"abstract\"><p class=\"shortdesc\"></p></div>"},"d1e46": {"l": "./chapter1.html#topic_rxx_dkt_bdc","t": "Chapter 1","d": "<div class=\"abstract\"><p class=\"shortdesc\">Meet Charlie the Choo-Choo Bob Brooks was an engineer for the Mid-World Railway Company, on a route from St. Louis, Missouri to Topeka, Kansas. Engineer Bob was the best trainman the Mid-World Railway Company ever had, and Charlie was the best train! Charlie was a 402 Big B...</p></div>"},"d1e53": {"l": "./chapter5.html#topic_rxx_dkt_bdc","t": "Chapter 5","d": "<div class=\"abstract\"><p class=\"shortdesc\">Dark Days Mr. Martin, the president of the Mid-World Railway Company, wrote and offered to put Engineer Bob in charge of the new Burlington Zephyr. \"It is a fine loco, Engineer Bob,\" said Mr. Martin, \"chock-full of zip and zowie, and you should be the one to pilot it! Of al...</p></div>"},"d1e60": {"l": "./chapter7.html#topic_rxx_dkt_bdc","t": "chapter7","d": "<div class=\"abstract\"><p class=\"shortdesc\"></p></div>"}}