{"d1e3": {"l": "./chapter2.html#topic_rxx_dkt_bdc","t": "Chapter 2","d": "<div class=\"abstract\"><p class=\"shortdesc\">Charlie's Song \"I told you,\" said Charlie the Choo-Choo. \"How come I never knew you were alive before?\" asked Engineer Bob. \"Why didn't you ever talk to me before?\" Then Charlie sang this song to Engineer Bob in his small, gruff voice: INSERT SONG CONTENT REF Best Friends \"...</p></div>"},"d1e10": {"l": "./chapter3.html#topic_rxx_dkt_bdc","t": "Chapter 3","d": "<div class=\"abstract\"><p class=\"shortdesc\">New Train in Town One day, when Engineer Bob returned to St. Louis, they found a new diesel locomotive in Charlie's berth. And what a diesel locomotive it was! Five thousand horsepower! Stainless steel connectors ! Traction motors from the Utica Engine Works in Utica, New Y...</p></div>"},"d1e17": {"l": "./chapter4.html#topic_rxx_dkt_bdc","t": "Chapter 4","d": "<div class=\"abstract\"><p class=\"shortdesc\">Replaced \"Nonsense!\" Engineer Bob was mad! \"Charlie is still full of zip and zowie! I will telegraph the head office of the Mid-World Railway Company! I will telegraph the president, Mr. Raymond Martin, myself! I know him because he once gave me a Good Service Award, and af...</p></div>"},"d1e24": {"l": "./chapter6.html#topic_rxx_dkt_bdc","t": "Chapter 6","d": "<div class=\"abstract\"><p class=\"shortdesc\">The President has a Problem Mr. Martin, the president of the Mid-World Railway Company, came to St. Louis to check on the operation. His plan was to ride the Burlington Zephyr to Topeka, where his daughter was giving her first piano recital, that very afternoon. Only the Ze...</p></div>"},"d1e31": {"l": "./index.html#topic_aw3_bt2_bdc","t": "Charlie the Choo-Choo","d": "<p class=\"shortdesc\"> Adapted by Kailey Watson. </p> "},"d1e39": {"l": "./chapter1.html#chapter1","t": "Chapter 1","d": "<p class=\"shortdesc\"> Engineer Bob and the steam train Charlie are the best team in the Mid-World Railway Company. Charlie reveals he is alive. </p> "},"d1e46": {"l": "./chapter5.html#topic_rxx_dkt_bdc","t": "Chapter 5","d": "<div class=\"abstract\"><p class=\"shortdesc\">Dark Days Mr. Martin, the president of the Mid-World Railway Company, wrote and offered to put Engineer Bob in charge of the new Burlington Zephyr. \"It is a fine loco, Engineer Bob,\" said Mr. Martin, \"chock-full of zip and zowie, and you should be the one to pilot it! Of al...</p></div>"},"d1e53": {"l": "./chapter7.html#topic_rxx_dkt_bdc","t": "Chapter 7","d": "<div class=\"abstract\"><p class=\"shortdesc\">Charlie's Back All over St. Louis the children heard that cry, and ran out into their yards to watch the rusty old steam loco pass. \"Look!\" they cried. \"It's Charlie! Charlie the Choo-Choo is back! Hurrah!\" They all waved, and as Charlie steamed out of town, gathering speed...</p></div>"}}